---
kind: type
id: T:Autodesk.Revit.DB.InternalDefinition
source: html/97f42435-3067-622e-7a34-919f42f6ab97.htm
---
# Autodesk.Revit.DB.InternalDefinition

This object represents a parameter definition in an Autodesk Revit model.

## Syntax (C#)
```csharp
public class InternalDefinition : Definition,
	IDisposable
```